app/controllers/mypage_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def show
    # 指定されたIDのユーザ情報を取得
    @user = User.find(params[:id])