app/controllers/orders_controller.rb

  def new
   @order = Order.new   # 新しい注文オブジェクトを作成
   @product = Product.find(params[:product_id])   # URLから商品を取得
---
SELECT "products".* FROM "products" WHERE "products"."id" = 2 LIMIT 1

  def confirm
    @order = Order.new(order_params)          # フォームから送信された注文情報を取得
    @product = Product.find(order_params[:product_id]) # 注文対象の商品を取得
---
SELECT "products".* FROM "products" WHERE "products"."id" = 4 LIMIT 1

  def create
    @order = Order.new(order_params)
    @order.user_id = current_user.id # ログイン中のユーザーIDを紐付け
    # 注文が正常に保存できた場合
    if @order.save
      redirect_to complete_order_path(@order)     # 登録が完了したら注文完了ページへ遷移
    else
      @product = Product.find(@order.product_id)
---
INSERT INTO "orders" ("count", "total_price", "address", "product_id", "user_id", "created_at", "updated_at") VALUES (10, 5000, '大阪市中央区南船場', 4, 4, '2026-01-27 11:53:15.965151', '2026-01-27 11:53:15.965151') RETURNING "id"
SELECT "products".* FROM "products" WHERE "products"."id" = 4 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1

  def complete
    @order = Order.find(params[:id])
    @product = Product.find(@order.product_id)
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 2 LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."id" = 4 LIMIT 1

  def index
    @orders = current_user.orders.all # ユーザーに紐付いた注文履歴を表示
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = 4