app/controllers/products_controller.rb

  def create
    # フォームから送られたデータを元に新しい商品を作成
    @product = Product.new(product_params)
    # データをデータベースに保存する
    if @product.save
---
INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES ('オレンジ', '甘くておいしい', 500, '2026-01-26 07:31:14.237591', '2026-01-26 07:31:14.237591') RETURNING "id"

  def edit
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 2 LIMIT 1

  def update
    @product = Product.find(params[:id])
    if @product.update(product_params)
---
SELECT "products".* FROM "products" WHERE "products"."id" = 2 LIMIT 1
UPDATE "products" SET "description" = 'バレンシア', "price" = 250, "updated_at" = '2026-01-26 10:01:08.169948' WHERE "products"."id" = 2

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
DELETE FROM "products" WHERE "products"."id" = 1