app/controllers/concerns/price_calculations.rb

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
---
  def cart_calculation
    session[:cart].each do |item|
      product = Product.find(item["id"].to_i)